QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5180_Reg.h
#define RF_STATUS                                                                                         0x1DU
#define RF_STATUS_TRANSCEIVE_STATE_POS                                                                   (24U)
#define RF_STATUS_TRANSCEIVE_STATE_MASK                                                                  (0x07000000U)  /**< r--This registers hold the command bits 0* IDLE state 1 WaitTransmit state 2 Transmitting state 3 WaitReceive state 4 WaitForData state 5 Receiving state 6 LoopBack state 7 reserved*/
#define RF_STATUS_OCPROT_CURRENT_GEAR_POS                                                                (20U)
#define RF_STATUS_OCPROT_CURRENT_GEAR_MASK                                                               (0x00F00000U)  /**< r--OcProt status, current gear*/
#define RF_STATUS_DPLL_ENABLE_POS                                                                        (19U)
#define RF_STATUS_DPLL_ENABLE_MASK                                                                       (0x00080000U)  /**< r--This bit indicates that the DPLL Controler has enabled the DPLL (RF on, RF frequency ok, PLL locked)*/
#define RF_STATUS_CRC_OK_POS                                                                             (18U)
#define RF_STATUS_CRC_OK_MASK                                                                            (0x00040000U)  /**< r--This bit indicates the status of the actual CRC calculation. If 1 the CRC is correct; meaning the CRC register has the value 0 or the residue value if inverted CRC is used. Note: This flag should only by evaluated at the end of a communication */
#define RF_STATUS_TX_RF_STATUS_POS                                                                       (17U)
#define RF_STATUS_TX_RF_STATUS_MASK                                                                      (0x00020000U)  /**< r--If set to 1 this bit indicates that the drivers are turned on; meaning an RF-Field is created by the device itself. */
#define RF_STATUS_RF_DET_STATUS_POS                                                                      (16U)
#define RF_STATUS_RF_DET_STATUS_MASK                                                                     (0x00010000U)  /**< r--If set to 1 this bit indicates that an external RF-Field is detected by the rf level detectors (after digital filtering) */
#define RF_STATUS_RF_ACTIVE_ERROR_CAUSE_POS                                                              (13U)
#define RF_STATUS_RF_ACTIVE_ERROR_CAUSE_MASK                                                             (0x0000E000U)  /**< r--This status flag indicates the cause of an NFC-Active error. Note: This bits are only valid when the RF_ACTIVE_ERROR_IRQ is raised and will be cleared as soon as the bit TX_RF_ENABLE is set to 1. 0* No Error; reset value 1 External field was detected on within TIDT timing 2 External field was detected on within TADT timing 3 No external field was detected within TADT timings 4 Peer did switch off RFField without but no Rx event was raised (no data received) 5 - 7 Reserved */
#define RF_STATUS_RX_ENABLE_POS                                                                          (12U)
#define RF_STATUS_RX_ENABLE_MASK                                                                         (0x00001000U)  /**< r--This bit indicates if the RxDecoder is enalbed. If 1 the RxDecoder was enabled by the Transceive Unit and is now ready for data reception */
#define RF_STATUS_TX_ACTIVE_POS                                                                          (11U)
#define RF_STATUS_TX_ACTIVE_MASK                                                                         (0x00000800U)  /**< r--This bit indicates activity of the TxEncoder. If 1 a transmission is ongoing, otherwise the TxEncoder is in idle state.*/
#define RF_STATUS_RX_ACTIVE_POS                                                                          (10U)
#define RF_STATUS_RX_ACTIVE_MASK                                                                         (0x00000400U)  /**< r--This bit indicates activity of the RxDecoder. If 1 a data reception is ongoing; otherwise the RxDecoder is in idle state. */
#define RF_STATUS_AGC_VALUE_POS                                                                          (0U)
#define RF_STATUS_AGC_VALUE_MASK                                                                         (0x000003FFU)  /**< r--Current value of the AGC*/

#define AGC_CONFIG                                                                                        0x1EU
#define AGC_CONFIG_AGC_VREF_SEL_POS                                                                      (14U)
#define AGC_CONFIG_AGC_VREF_SEL_MASK                                                                     (0x0000C000U)  /**< rw-Select the comparison reference voltage*/
#define AGC_CONFIG_AGC_TIME_CONSTANT_POS                                                                 (4U)
#define AGC_CONFIG_AGC_TIME_CONSTANT_MASK                                                                (0x00003FF0U)  /**< rw-Time constant for the AGC update. An AGC period is given by (AGC_TIME_CONSTANT+1U ) * 13.56MHz*/
#define AGC_CONFIG_AGC_INPUT_SEL_POS                                                                     (3U)
#define AGC_CONFIG_AGC_INPUT_SEL_MASK                                                                    (0x00000008U)  /**< rw-Selects the AGC value to be loaded into the AGC and the scource for manual mode: 0* CLIF_AGC_INPUT_REG.AGC_CM_VALUE 1 CLIF_AGC_INPUT_REG.AGC_RM_VALUE*/
#define AGC_CONFIG_AGC_LOAD_POS                                                                          (2U)
#define AGC_CONFIG_AGC_LOAD_MASK                                                                         (0x00000004U)  /**< -x-If set; one AGC control value is loaded from CLIF_AGC_VALUE_REG .into the internal AGC register (depending on AGC_INPUT_SEL). */
#define AGC_CONFIG_AGC_MODE_SEL_POS                                                                      (1U)
#define AGC_CONFIG_AGC_MODE_SEL_MASK                                                                     (0x00000002U)  /**< rw-Selects the operation mode of the AGC: 0* Rx-Divider is controlled by the register CLIF_AGC_INPUT_REG.AGC_CM_VALUE or CLIF_AGC_INPUT_REG.AGC_RM_VALUE (dependent on AGC_INPUT_SEL) 1 Rx-Divider value is controlled by the AGC.*/
#define AGC_CONFIG_AGC_MODE_ENABLE_POS                                                                   (0U)
#define AGC_CONFIG_AGC_MODE_ENABLE_MASK                                                                  (0x00000001U)  /**< rw-If set, the AGC is enabled. If not set, the Rx-Divider is controlled by either the internal AGC register or a register value (dependent on AGC_MODE_SEL).*/

#define AGC_VALUE                                                                                         0x1FU
#define AGC_VALUE_AGC_RM_VALUE_POS                                                                       (10U)
#define AGC_VALUE_AGC_RM_VALUE_MASK                                                                      (0x000FFC00U)  /**< rw-Static AGC value used for reader mode */
#define AGC_VALUE_AGC_CM_VALUE_POS                                                                       (0U)
#define AGC_VALUE_AGC_CM_VALUE_MASK                                                                      (0x000003FFU)  /**< rw-Static AGC value used for card mode*/

