QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5180_Reg.h
#define ANA_RF_CONTROL_TX                                                                                 0x20U
#define ANA_RF_CONTROL_TX_TX_ALM_TYPE_SELECT_POS                                                         (26U)
#define ANA_RF_CONTROL_TX_TX_ALM_TYPE_SELECT_MASK                                                        (0x04000000U)  /**< rw-Defines which ALM type is used. If set to 1 Dual-Loop-ALM is used, default (0) is Single-Loop-ALM.*/
#define ANA_RF_CONTROL_TX_TX_CW_AMPLITUDE_ALM_CM_POS                                                     (24U)
#define ANA_RF_CONTROL_TX_TX_CW_AMPLITUDE_ALM_CM_MASK                                                    (0x03000000U)  /**< rw-set amplitude of unmodulated carrier at card mode*/
#define ANA_RF_CONTROL_TX_TX_RESIDUAL_CARRIER_OV_PREV_POS                                                (19U)
#define ANA_RF_CONTROL_TX_TX_RESIDUAL_CARRIER_OV_PREV_MASK                                               (0x00F80000U)  /**< rw-Defines the value for the residual carrier for the period the overshoot prevention pattern is active.*/
#define ANA_RF_CONTROL_TX_TX_CW_TO_MAX_ALM_CM_POS                                                        (18U)
#define ANA_RF_CONTROL_TX_TX_CW_TO_MAX_ALM_CM_MASK                                                       (0x00040000U)  /**< rw-TX HI output is the maximum voltage obtainable from charge pump (CM setting); if set to 1 -> TX_CW_AMPLITUDE_CM is overruled.*/
#define ANA_RF_CONTROL_TX_TX_RESIDUAL_CARRIER_POS                                                        (13U)
#define ANA_RF_CONTROL_TX_TX_RESIDUAL_CARRIER_MASK                                                       (0x0003E000U)  /**< rw-set residual carrier (0=100%, 1F = 0%)*/
#define ANA_RF_CONTROL_TX_TX_SET_BYPASS_SC_SHAPING_POS                                                   (12U)
#define ANA_RF_CONTROL_TX_TX_SET_BYPASS_SC_SHAPING_MASK                                                  (0x00001000U)  /**< rw-Bypasses switched capacitor shaping of the Transmitter Signal*/
#define ANA_RF_CONTROL_TX_TX_SET_SLEW_SHUNTREG_POS                                                       (8U)
#define ANA_RF_CONTROL_TX_TX_SET_SLEW_SHUNTREG_MASK                                                      (0x00000F00U)  /**< rw-Set slew rate for shunt regulator*/
#define ANA_RF_CONTROL_TX_TX_SET_TAU_MOD_FALLING_POS                                                     (4U)
#define ANA_RF_CONTROL_TX_TX_SET_TAU_MOD_FALLING_MASK                                                    (0x000000F0U)  /**< rw-Transmitter TAU setting for falling edge of modulation shape. In AnalogControl module the output signal is switched with the tx_envelope. Only valid is TX_SET_SINGLE_CP_MODE is set*/
#define ANA_RF_CONTROL_TX_TX_SET_TAU_MOD_RISING_POS                                                      (0U)
#define ANA_RF_CONTROL_TX_TX_SET_TAU_MOD_RISING_MASK                                                     (0x0000000FU)  /**< rw-Transmitter TAU setting for rising edge of modulation shape. In AnalogControl module the output signal is switched with the tx_envelope. Only valid is TX_SET_SINGLE_CP_MODE is set*/

#define ANA_RF_CONTROL_TX_CLK                                                                             0x21U
#define ANA_RF_CONTROL_TX_CLK_TX_ALM_ENABLE_POS                                                          (18U)
#define ANA_RF_CONTROL_TX_CLK_TX_ALM_ENABLE_MASK                                                         (0x00040000U)  /**< rw-If set to 1 ALM is used for transmission in card mode*/
#define ANA_RF_CONTROL_TX_CLK_CLOCK_TX_SEL_SLALM_POS                                                     (17U)
#define ANA_RF_CONTROL_TX_CLK_CLOCK_TX_SEL_SLALM_MASK                                                    (0x00020000U)  /**< rw-Selects DPLL*/
#define ANA_RF_CONTROL_TX_CLK_CLOCK_PD_RF_27M12_POS                                                      (16U)
#define ANA_RF_CONTROL_TX_CLK_CLOCK_PD_RF_27M12_MASK                                                     (0x00010000U)  /**< rw-Power down RF clock generation*/
#define ANA_RF_CONTROL_TX_CLK_CLOCK_ADC_SEL_RF_POS                                                       (15U)
#define ANA_RF_CONTROL_TX_CLK_CLOCK_ADC_SEL_RF_MASK                                                      (0x00008000U)  /**< rw-Select RF clock for ADC from DLL or PLL*/
#define ANA_RF_CONTROL_TX_CLK_CLOCK_TX_SEL_RF_POS                                                        (14U)
#define ANA_RF_CONTROL_TX_CLK_CLOCK_TX_SEL_RF_MASK                                                       (0x00004000U)  /**< rw-Select DLL clock for TX (instead of PLL clock)*/
#define ANA_RF_CONTROL_TX_CLK_CLOCK_CONFIG_DLL_ALM_POS                                                   (11U)
#define ANA_RF_CONTROL_TX_CLK_CLOCK_CONFIG_DLL_ALM_MASK                                                  (0x00003800U)  /**< rw-Select DLL clock phase*/
#define ANA_RF_CONTROL_TX_CLK_TX_CLK_MODE_OVUN_PREV_POS                                                  (8U)
#define ANA_RF_CONTROL_TX_CLK_TX_CLK_MODE_OVUN_PREV_MASK                                                 (0x00000700U)  /**< rw-Defines the TX clockmode for the period the overshoot/undershoot prevention is active*/
#define ANA_RF_CONTROL_TX_CLK_TX2_INV_RM_POS                                                             (7U)
#define ANA_RF_CONTROL_TX_CLK_TX2_INV_RM_MASK                                                            (0x00000080U)  /**< rw-If 1 -> TX output is inverted (clk_13m56_n is used); 0 -> clk_13m56 is used*/
#define ANA_RF_CONTROL_TX_CLK_TX2_INV_CM_POS                                                             (6U)
#define ANA_RF_CONTROL_TX_CLK_TX2_INV_CM_MASK                                                            (0x00000040U)  /**< rw-If 1 -> TX output is inverted (clk_13m56_n is used); 0 -> clk_13m56 is used*/
#define ANA_RF_CONTROL_TX_CLK_TX1_INV_RM_POS                                                             (5U)
#define ANA_RF_CONTROL_TX_CLK_TX1_INV_RM_MASK                                                            (0x00000020U)  /**< rw-If 1 -> TX output is inverted (clk_13m56_n is used); 0 -> clk_13m56 is used*/
#define ANA_RF_CONTROL_TX_CLK_TX1_INV_CM_POS                                                             (4U)
#define ANA_RF_CONTROL_TX_CLK_TX1_INV_CM_MASK                                                            (0x00000010U)  /**< rw-If 1 -> TX output is inverted (clk_13m56_n is used); 0 -> clk_13m56 is used*/
#define ANA_RF_CONTROL_TX_CLK_TX_CLK_MODE_RM_POS                                                         (1U)
#define ANA_RF_CONTROL_TX_CLK_TX_CLK_MODE_RM_MASK                                                        (0x0000000EU)  /**< rw-TX clockmode*/
#define ANA_RF_CONTROL_TX_CLK_CLOCK_ENABLE_DPLL_POS                                                      (0U)
#define ANA_RF_CONTROL_TX_CLK_CLOCK_ENABLE_DPLL_MASK                                                     (0x00000001U)  /**< rw-Enables the DPLL*/

#define ANA_RF_CONTROL_RX                                                                                 0x22U
#define ANA_RF_CONTROL_RX_CM_MILLER_SENS_POS                                                             (6U)
#define ANA_RF_CONTROL_RX_CM_MILLER_SENS_MASK                                                            (0x000000C0U)  /**< rw-Configuration bits for reference level of Miller demodulator*/
#define ANA_RF_CONTROL_RX_RX_MIXER_CONTROL_POS                                                           (4U)#define ANA_RF_CONTROL_RX_RX_MIXER_CONTROL_MASK                                                          (0x00000030U)  /**< rw-00,11 ... power down both mixer 01... reader mode mixer 10... card mode mixer, */
#define ANA_RF_CONTROL_RX_RX_HPCF_POS                                                                    (2U)
#define ANA_RF_CONTROL_RX_RX_HPCF_MASK                                                                   (0x0000000CU)  /**< rw-Lower Corner Frequency: 00->45kHz, 01->85kHz, 10->150kHz, 11->250kHz*/
#define ANA_RF_CONTROL_RX_RX_GAIN_POS                                                                    (0U)
#define ANA_RF_CONTROL_RX_RX_GAIN_MASK                                                                   (0x00000003U)  /**< rw-Gain Adjustment BBA: 00->33dBU, 01->40dBU, 10->50dBU, 11->57dB*/

#define LD_CONTROL                                                                                        0x23U
#define LD_CONTROL_CM_PD_NFC_DET_POS                                                                     (14U)
#define LD_CONTROL_CM_PD_NFC_DET_MASK                                                                    (0x00004000U)  /**< rw-Power Down NFC level detector*/
#define LD_CONTROL_RFDET_SOURCE_SEL_POS                                                                  (12U)
#define LD_CONTROL_RFDET_SOURCE_SEL_MASK                                                                 (0x00003000U)  /**< rw-Select the source for RF-Field detection; 0* -> NFC-Level detector indication signal is used; 1 -> RF-Level detector indication signal is used 2; -> NFC- and RF-Level detector indication signal is used 3; -> Override - RF-Field detected is emulated*/
#define LD_CONTROL_CM_RFL_NFC_POS                                                                        (8U)
#define LD_CONTROL_CM_RFL_NFC_MASK                                                                       (0x00000F00U)  /**< rw-Programming of detection level*/
#define LD_CONTROL_RFLD_REF_LO_POS                                                                       (4U)
#define LD_CONTROL_RFLD_REF_LO_MASK                                                                      (0x000000F0U)  /**< rw-Higher Reference Value for RF Level Detector*/
#define LD_CONTROL_RFLD_REF_HI_POS                                                                       (0U)
#define LD_CONTROL_RFLD_REF_HI_MASK                                                                      (0x0000000FU)  /**< rw-Lower Reference Value for RF Level Detector*/

#define SYSTEM_STATUS                                                                                     0x24U
#define SYSTEM_STATUS_PARAMETER_ERROR_POS                                                                (8U)
#define SYSTEM_STATUS_PARAMETER_ERROR_MASK                                                               (0x00000100U)  /**< r--*/
#define SYSTEM_STATUS_SYNTAX_ERROR_POS                                                                   (7U)
#define SYSTEM_STATUS_SYNTAX_ERROR_MASK                                                                  (0x00000080U)  /**< r--*/
#define SYSTEM_STATUS_SEMANTIC_ERROR_POS                                                                 (6U)
#define SYSTEM_STATUS_SEMANTIC_ERROR_MASK                                                                (0x00000040U)  /**< r--*/
#define SYSTEM_STATUS_STBY_PREVENT_RFLD_POS                                                              (5U)
#define SYSTEM_STATUS_STBY_PREVENT_RFLD_MASK                                                             (0x00000020U)  /**< r--*/
#define SYSTEM_STATUS_BOOT_TEMP_POS                                                                      (4U)
#define SYSTEM_STATUS_BOOT_TEMP_MASK                                                                     (0x00000010U)  /**< r--*/
#define SYSTEM_STATUS_BOOT_SOFT_RESET_POS                                                                (3U)
#define SYSTEM_STATUS_BOOT_SOFT_RESET_MASK                                                               (0x00000008U)  /**< r--*/
#define SYSTEM_STATUS_BOOT_WUC_POS                                                                       (2U)
#define SYSTEM_STATUS_BOOT_WUC_MASK                                                                      (0x00000004U)  /**< r--*/
#define SYSTEM_STATUS_BOOT_RFLD_POS                                                                      (1U)
#define SYSTEM_STATUS_BOOT_RFLD_MASK                                                                     (0x00000002U)  /**< r--*/
#define SYSTEM_STATUS_BOOT_POR_POS                                                                       (0U)
#define SYSTEM_STATUS_BOOT_POR_MASK                                                                      (0x00000001U)  /**< r--*/

#define TEMP_CONTROL                                                                                      0x25U
#define TEMP_CONTROL_TEMP_ENABLE_HYST_POS                                                                (3U)
#define TEMP_CONTROL_TEMP_ENABLE_HYST_MASK                                                               (0x00000008U)  /**< rw-Enable Hystere of Temperature Sensor*/
#define TEMP_CONTROL_TEMP_ENABLE_POS                                                                     (2U)
#define TEMP_CONTROL_TEMP_ENABLE_MASK                                                                    (0x00000004U)  /**< rw-Enable Temp Sensor*/
#define TEMP_CONTROL_TEMP_DELTA_POS                                                                      (0U)
#define TEMP_CONTROL_TEMP_DELTA_MASK                                                                     (0x00000003U)  /**< rw-selects temperatur value*/

#define AGC_REF_CONFIG                                                                                    0x26U
#define AGC_REF_CONFIG_AGC_GEAR_POS                                                                      (10U)
#define AGC_REF_CONFIG_AGC_GEAR_MASK                                                                     (0x00003C00U)  /**< rw-*/
#define AGC_REF_CONFIG_AGC_VALUE_POS                                                                     (0U)
#define AGC_REF_CONFIG_AGC_VALUE_MASK                                                                    (0x000003FFU)  /**< rw-*/

#define TXOCP_CONTROL                                                                                     0x27U
#define TXOCP_CONTROL_TX_GSN_CW_CM_POS                                                                   (16U)
#define TXOCP_CONTROL_TX_GSN_CW_CM_MASK                                                                  (0x000F0000U)  /**< rw-gsn setting at continuous wave in card mode*/
#define TXOCP_CONTROL_TX_GSN_MOD_CM_POS                                                                  (12U)
#define TXOCP_CONTROL_TX_GSN_MOD_CM_MASK                                                                 (0x0000F000U)  /**< rw-gsn setting at continuous wave in card mode*/
#define TXOCP_CONTROL_TX_GSN_MOD_RM_POS                                                                  (8U)
#define TXOCP_CONTROL_TX_GSN_MOD_RM_MASK                                                                 (0x00000F00U)  /**< rw-gsn setting at continuous wave in reader mode*/
#define TXOCP_CONTROL_TX_GSN_CW_RM_POS                                                                   (4U)
#define TXOCP_CONTROL_TX_GSN_CW_RM_MASK                                                                  (0x000000F0U)  /**< rw-gsn setting at continuous wave in reader mode*/
#define TXOCP_CONTROL_TX_CW_TO_MAX_RM_POS                                                                (3U)
#define TXOCP_CONTROL_TX_CW_TO_MAX_RM_MASK                                                               (0x00000008U)  /**< rw-TX HI output is the maximum voltage obtainable from charge pump (RM setting); if set to 1 -> TX_CW_AMPLITUDE_RM is overruled.*/
#define TXOCP_CONTROL_TX_CW_AMPLITUDE_RM_POS                                                             (1U)
#define TXOCP_CONTROL_TX_CW_AMPLITUDE_RM_MASK                                                            (0x00000006U)  /**< rw-set amplitude of unmodulated carrier at reader mode*/
#define TXOCP_CONTROL_TX_CW_AMP_REF2TVDD_POS                                                             (0U)
#define TXOCP_CONTROL_TX_CW_AMP_REF2TVDD_MASK                                                            (0x00000001U)  /**< rw-If set to 1 the reference of the unmodulated carrier is defined relative to TVDDNote: Do not change in normal operation*/

#define EMD_CONTROL                                                                                       0x28U
#define EMD_CONTROL_EMD_TRANSMISSION_TIMER_USED_POS                                                      (8U)
#define EMD_CONTROL_EMD_TRANSMISSION_TIMER_USED_MASK                                                     (0x00000300U)  /**< rw-Timer used for RF communication.
00 ... Timer0
01 ... Timer1
10 ... Timer 2
11 ... RFU*/
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_B_POS                                         (7U)
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_B_MASK                                        (0x00000080U)  /**< rw-Missing CRC treated as protocol error in case of Type B based communication*/
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_A_POS                                         (6U)
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_A_MASK                                        (0x00000040U)  /**< rw-Missing CRC treated as protocol error in case of Type A based communication*/
#define EMD_CONTROL_EMD_NOISE_BYTES_THRESHOLD_POS                                                        (2U)
#define EMD_CONTROL_EMD_NOISE_BYTES_THRESHOLD_MASK                                                       (0x0000003CU)  /**< rw-Defines the threshold under which transmission errors are treated as noise. Note: CRC bytes are NOT included/counted!*/
#define EMD_CONTROL_EMD_TRANSMISSION_ERROR_ABOVE_NOISE_THRESHOLD_IS_NO_EMD_POS                           (1U)
#define EMD_CONTROL_EMD_TRANSMISSION_ERROR_ABOVE_NOISE_THRESHOLD_IS_NO_EMD_MASK                          (0x00000002U)  /**< rw-Transmission errors with received byte length >= EMD_NOISE_BYTES_THRESHOLD is never treated as EMD (EMVCo 2.5 standard)*/
#define EMD_CONTROL_EMD_ENABLE_POS                                                                       (0U)
#define EMD_CONTROL_EMD_ENABLE_MASK                                                                      (0x00000001U)  /**< rw-EMD handling enabled*/

#define FELICA_EMD_CONTROL                                                                                0x43U
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_BYTE_VALUE_POS                                                  (24UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_BYTE_VALUE_MASK                                                 (0xFF000000UL)  /**< rw-RC byte value that needs to be received to not treat the frame as EMD*/
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MAX_POS                                                (16UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MAX_MASK                                               (0x00FF0000UL)  /**< rw-Maximum Legth byte value that needs to be received to not treat the frame as EMD*/
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MIN_POS                                                (8UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MIN_MASK                                               (0x0000FF00UL)  /**< rw-Minimum Legth byte value that needs to be received to not treat the frame as EMD*/
#define FELICA_EMD_CONTROL_RESERVED_POS                                                                  (5UL)
#define FELICA_EMD_CONTROL_RESERVED_MASK                                                                 (0x000000E0UL)  /**< r--Reserved */
#define FELICA_EMD_CONTROL_FELICA_EMD_INTEGRITY_ERR_CHECK_ENABLE_POS                                     (4UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_INTEGRITY_ERR_CHECK_ENABLE_MASK                                    (0x00000010UL)  /**< rw-FeliCa EMD handling enabled when integrity error is set*/
#define FELICA_EMD_CONTROL_FELICA_EMD_PROTOCOL_ERR_CHECK_ENABLE_POS                                      (3UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_PROTOCOL_ERR_CHECK_ENABLE_MASK                                     (0x00000008UL)  /**< rw-FeliCa EMD handling enabled when protocol error is set*/
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_CHECK_ENABLE_POS                                                (2UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_CHECK_ENABLE_MASK                                               (0x00000004UL)  /**< rw-RC byte check enabled for FeliCa EMD handling */
#define FELICA_EMD_CONTROL_FELICA_EMD_LEN_CHECK_ENABLE_POS                                               (1UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_LEN_CHECK_ENABLE_MASK                                              (0x00000002UL)  /**< rw-Length byte check enabled for FeliCa EMD handling*/
#define FELICA_EMD_CONTROL_FELICA_EMD_ENABLE_POS                                                         (0UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_ENABLE_MASK                                                        (0x00000001UL)  /**< rw-FeliCa EMD handling enabled*/

#define ANA_PBF_CONTROL                                                                                   0x29U
#define ANA_PBF_CONTROL_PBF_INVERT_ON_TXACTIVE_POS                                                       (7U)
#define ANA_PBF_CONTROL_PBF_INVERT_ON_TXACTIVE_MASK                                                      (0x00000080U)  /**< rw-If set to 1, the PbF short interface in card mode is inverted when tx_active is asserted (i.e. while transmission). Note: this bit is only valid in card mode. Note: if it BF_ALM_AUTO_SWITCH_ENABLE is set this setting is ignored*/
#define ANA_PBF_CONTROL_PBF_ALM_AUTO_SWITCH_ENABLE_POS                                                   (6U)
#define ANA_PBF_CONTROL_PBF_ALM_AUTO_SWITCH_ENABLE_MASK                                                  (0x00000040U)  /**< rw-If set to 1, the PBF settting for ALM is switch automatically by HW. By default for ALM the pbf_short and pbf_mod uses the same settings as for PLM.*/
#define ANA_PBF_CONTROL_PBF_ALM_FW_RESET_POS                                                             (5U)
#define ANA_PBF_CONTROL_PBF_ALM_FW_RESET_MASK                                                            (0x00000020U)  /**< -x-If set to 1 the PBF setting for ALM is reset to its initial receive configuration*/
#define ANA_PBF_CONTROL_PBF_SHORT_SELECT_RM_POS                                                          (4U)
#define ANA_PBF_CONTROL_PBF_SHORT_SELECT_RM_MASK                                                         (0x00000010U)  /**< rw-Selects the control of the PbF modulation interface in reader mode*/
#define ANA_PBF_CONTROL_PBF_SHORT_SELECT_POS                                                             (2U)
#define ANA_PBF_CONTROL_PBF_SHORT_SELECT_MASK                                                            (0x0000000CU)  /**< rw-Selects the control of the PbF short interface in cardmode for PLM; in reader mode and ALM the analog control signals are switched by digital logic.   00b Constant 0 (PbF open)    01b Constant 1 (PbF short)   10b TxEnvelope used (idle = 1, modulation = 0)   11b Inverted TxEnvelope used (idle = 0, modulation = 1)*/
#define ANA_PBF_CONTROL_PBF_MOD_SELECT_POS                                                               (0U)
#define ANA_PBF_CONTROL_PBF_MOD_SELECT_MASK                                                              (0x00000003U)  /**< rw-Selects the control of the PbF modulation interface in cardmode for PLM; in reader mode and ALM the analog control signals are switched by digital logic.   00b Constant 0 (No modulation on PbF mod )   01b Constant 1 (modulation on PbF mod)   10b TxEnvelope used (idle = 1, modulation = 0)   11b Inverted TxEnvelope used (idle = 0, modulation = 1)*/

