QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5180_Reg.h
#define MISC_CONTROL_RFU                                                                                  0x33U
#define MISC_CONTROL_RFU_TADT_EXTEND_SELECT_POS                                                          (5U)
#define MISC_CONTROL_RFU_TADT_EXTEND_SELECT_MASK                                                         (0x00000060U)  /**< rw-By setting a value != 0 the minimum time for TADT can be increased*/
#define MISC_CONTROL_RFU_LONG_LD_MASK_ENABLE_POS                                                         (4U)
#define MISC_CONTROL_RFU_LONG_LD_MASK_ENABLE_MASK                                                        (0x00000010U)  /**< rw-If set to 1, the masking time for the NFC-LD after TxRFOff is longer.*/
#define MISC_CONTROL_RFU_TIDT_SKIP_ENABLE_POS                                                            (3U)
#define MISC_CONTROL_RFU_TIDT_SKIP_ENABLE_MASK                                                           (0x00000008U)  /**< rw-If set to 1, the TIDT reload value is reduced to 1, resulting in a nearly immediate switch on of the RF-Field.*/
#define MISC_CONTROL_RFU_MILLER_DECODER_SEL_POS                                                          (2U)
#define MISC_CONTROL_RFU_MILLER_DECODER_SEL_MASK                                                         (0x00000004U)  /**< rw-Chooses the Miller decoder 0* Advanced Miller decoder (HFO clock based) 1 RF clock based Miller decoder*/
#define MISC_CONTROL_RFU_TADT_SKIP_CHECK_ENABLE_POS                                                      (1U)
#define MISC_CONTROL_RFU_TADT_SKIP_CHECK_ENABLE_MASK                                                     (0x00000002U)  /**< rw-If set to 1 the timing check for TADT is skipped */
#define MISC_CONTROL_RFU_RF_FREQ_OK_OVERRIDE_ENABLE_POS                                                  (0U)
#define MISC_CONTROL_RFU_RF_FREQ_OK_OVERRIDE_ENABLE_MASK                                                 (0x00000001U)  /**< rw-If set to 1 the frequency check of the RF-Clock is overridden. */

#define PAD_CONFIG_RFU                                                                                    0x34U
#define PAD_CONFIG_RFU_TX_GSN_SRC_SEL_POS                                                                (4U)
#define PAD_CONFIG_RFU_TX_GSN_SRC_SEL_MASK                                                               (0x00000010U)  /**< rw-Source of GSN value (0... SMU, 1... CLIF)*/
#define PAD_CONFIG_RFU_TX_GSN_CW_SB_POS                                                                  (0U)
#define PAD_CONFIG_RFU_TX_GSN_CW_SB_MASK                                                                 (0x0000000FU)  /**< rw-GSN Value for Standby Mode*/

#define ANA_AGC_RFU                                                                                       0x35U
#define ANA_AGC_RFU_AGC_PD_POS                                                                           (0U)
#define ANA_AGC_RFU_AGC_PD_MASK                                                                          (0x00000001U)  /**< rw-AGC power down*/

#define TX_CONTROL_RFU                                                                                    0x36U
#define TX_CONTROL_RFU_TX_CM_GSN_MOD_ON_TXACTIVE_POS                                                     (1U)
#define TX_CONTROL_RFU_TX_CM_GSN_MOD_ON_TXACTIVE_MASK                                                    (0x00000002U)  /**< rw-If set to 1, CM GSN value is switched with tx_active instead of envelope*/
#define TX_CONTROL_RFU_TX_INVERT_POS                                                                     (0U)
#define TX_CONTROL_RFU_TX_INVERT_MASK                                                                    (0x00000001U)  /**< rw-If this bit is set to 1, the resulting signal is inverted*/

#define SIGPRO_CM_CONFIG_RFU                                                                              0x37U
#define SIGPRO_CM_CONFIG_RFU_MILLER_SOURCE_EXT_POS                                                       (30U)
#define SIGPRO_CM_CONFIG_RFU_MILLER_SOURCE_EXT_MASK                                                      (0xC0000000U)  /**< rw-Defines if miller decoder uses the external modulation signal for decoding. Note: This setting (if not 0) overrides other input settings. 0: not used, 1: plain envelope from external device, 2: 100% envelope generated on 13.56MHz clock domain, 3: 100% envelope generated on HFO clock domain*/
#define SIGPRO_CM_CONFIG_RFU_USE_CMPLUS_MILLER_POS                                                       (29U)
#define SIGPRO_CM_CONFIG_RFU_USE_CMPLUS_MILLER_MASK                                                      (0x20000000U)  /**< rw-If set, the Miller decoder uses the CM plus (Manchester demodulator) as preferred analog demodulator. Note that if USE_CMPLUS_MILLER and USE_ADCBCM_MILLER are set, then the ADCBCM is used as input to the Miller decoder.*/
#define SIGPRO_CM_CONFIG_RFU_USE_ADCBCM_MANCHESTER_POS                                                   (28U)
#define SIGPRO_CM_CONFIG_RFU_USE_ADCBCM_MANCHESTER_MASK                                                  (0x10000000U)  /**< rw-If set; the ADC based Card-Mode output is used as input to the Manchester decoder. */
#define SIGPRO_CM_CONFIG_RFU_USE_ADCBCM_MILLER_POS                                                       (27U)
#define SIGPRO_CM_CONFIG_RFU_USE_ADCBCM_MILLER_MASK                                                      (0x08000000U)  /**< rw-If set; the ADC based Card-Mode output is used as input to the Miller decoder. */
#define SIGPRO_CM_CONFIG_RFU_SIGPRO_IN_SEL_POS                                                           (25U)
#define SIGPRO_CM_CONFIG_RFU_SIGPRO_IN_SEL_MASK                                                          (0x06000000U)  /**< rw-Defines the source of SigPro input signals. Note: PN548 analogue means for reader mode the ADC signals and for card mode the signal from the appropriate analog demodulator or the ADC based card mode. 00* TxEnvelope for loopback mode 01 Analog Modulator / ADCBCM 010 SigIn 011 Analog Modulator / ADCBCM + SigIn 100 TxEnvelope for loopback mode*/
#define SIGPRO_CM_CONFIG_RFU_TARGET_POS                                                                  (24U)
#define SIGPRO_CM_CONFIG_RFU_TARGET_MASK                                                                 (0x01000000U)  /**< rw-Defines that the receiver is in target mode. Note: Do not change this bit when the Rx-Decoder is enabled. */
#define SIGPRO_CM_CONFIG_RFU_SYNC_MODE_SEL_POS                                                           (22U)
#define SIGPRO_CM_CONFIG_RFU_SYNC_MODE_SEL_MASK                                                          (0x00C00000U)  /**< rw-Chooses the threshold for interpolation of the zero-crossing detection. 0h 0.25; 1h 0.5; 2h-3h 0.75*/
#define SIGPRO_CM_CONFIG_RFU_EPSILON_TH_POS                                                              (16U)
#define SIGPRO_CM_CONFIG_RFU_EPSILON_TH_MASK                                                             (0x003F0000U)  /**< rw-Threshold for the epsilon environment in the zero-crossing detection block. Note that with value 1h the block is disabled and the value 0h is forbidden. */
#define SIGPRO_CM_CONFIG_RFU_WATCH_DOG_VAL_POS                                                           (8U)
#define SIGPRO_CM_CONFIG_RFU_WATCH_DOG_VAL_MASK                                                          (0x0000FF00U)  /**< rw-Reset value for the Watch-Dog Counter.After this number of 848kHz clock cycles where no edges was detected, the Watch Dog counter resets the edge-locking, the output envelope, and the dynamic threshold.*/
#define SIGPRO_CM_CONFIG_RFU_WATCH_DOG_ENABLE_POS                                                        (7U)
#define SIGPRO_CM_CONFIG_RFU_WATCH_DOG_ENABLE_MASK                                                       (0x00000080U)  /**< rw-Enables the watch-dog timer to release the edge-locking after a certain time. */
#define SIGPRO_CM_CONFIG_RFU_SYNC_MODE_ENABLE_POS                                                        (6U)
#define SIGPRO_CM_CONFIG_RFU_SYNC_MODE_ENABLE_MASK                                                       (0x00000040U)  /**< rw-If set; the sync mode is activated. The sync-mode is used to reduce the jitter in the zero-crossing detection (usage depends on the analog HW configuration). */
#define SIGPRO_CM_CONFIG_RFU_EDGE_DETECT_DYN_ENABLE_POS                                                  (5U)
#define SIGPRO_CM_CONFIG_RFU_EDGE_DETECT_DYN_ENABLE_MASK                                                 (0x00000020U)  /**< rw-If set; the edge detecto threshold is dynamically adapted (1/4th bit energy of the last successful edge decision but not smaller than the threshold in CLIF_SIGPRO_ADCBCM_THRESHOLD_REG .EDGE_D ETECT_TH). */
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_848_POS                                                       (4U)
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_848_MASK                                                      (0x00000010U)  /**< rw-Enables the 848kBd envelope detection of the ADCBCM. */
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_424_POS                                                       (3U)
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_424_MASK                                                      (0x00000008U)  /**< rw-Enables the 424kBd envelope detection of the ADCBCM. At start up for mode-detection this mode has to be enabled. */
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_212_POS                                                       (2U)
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_212_MASK                                                      (0x00000004U)  /**< rw-Enables the 212kBd envelope detection of the ADCBCM. At start up for mode-detection this mode has to be enabled. */
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_106_POS                                                       (1U)
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_106_MASK                                                      (0x00000002U)  /**< rw-Enables the 106kBd envelope detection of the ADCBCM. At start up for mode-detection this mode has to be enabled. */
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_POS                                                           (0U)
#define SIGPRO_CM_CONFIG_RFU_ADCBCM_ENABLE_MASK                                                          (0x00000001U)  /**< rw-Enables the ADCBCM. Note that at least one mode (106; 212; 424; or 848kBd) has to enabled additionally. */

#define SIGPRO_CM_CONFIG2_RFU                                                                             0x38U
#define SIGPRO_CM_CONFIG2_RFU_MILLER_SYNC_ENABLE_POS                                                     (13U)
#define SIGPRO_CM_CONFIG2_RFU_MILLER_SYNC_ENABLE_MASK                                                    (0x00002000U)  /**< -If set to one miller pulse synchronisation is enabled. Note: TX_BITPHASE is used to adjust the prescaler of the guard timer. Note: This bit is set by HW when TypeA protocol is detected in automatic mode detection. */
#define SIGPRO_CM_CONFIG2_RFU_DIG_CLOCK_FAIL_DETECTION_ENABLE_POS                                        (12U)
#define SIGPRO_CM_CONFIG2_RFU_DIG_CLOCK_FAIL_DETECTION_ENABLE_MASK                                       (0x00001000U)  /**< rw-If set, digital clock detection is used instead of analog*/
#define SIGPRO_CM_CONFIG2_RFU_MANCHESTER_SOURCE_EXT_POS                                                  (11U)
#define SIGPRO_CM_CONFIG2_RFU_MANCHESTER_SOURCE_EXT_MASK                                                 (0x00000800U)  /**< rw-If set, the manchester decoder uses the external modulation signal for decoding. Note: This setting (if not 0) overrides other input settings*/
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_USE_RFCOUNTER_POS                                               (10U)
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_USE_RFCOUNTER_MASK                                              (0x00000400U)  /**< rw-If set the Adv. Miller decoder uses the RF counter directly for decoding. This feature is intended for 848kBd to avoid additional errors due to synchronization.*/
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_FILTER_ENABLE_POS                                               (9U)
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_FILTER_ENABLE_MASK                                              (0x00000200U)  /**< rw-If set the Miller input signal is filtered with a 3-out-of-5 median filter (on HFO clock), before decoding. Note: This feature is not available in combination with ADV_MILLER_USE_RFCOUNTER.*/
#define SIGPRO_CM_CONFIG2_RFU_NRZ_DEC_ENABLE_POS                                                         (8U)
#define SIGPRO_CM_CONFIG2_RFU_NRZ_DEC_ENABLE_MASK                                                        (0x00000100U)  /**< rw-If set the NRZ decoder is activated for ISO14443 type B PICC reception. Note that the NRZ decoder must be activated in general target mode to be able to detect ISO14443 type B.*/
#define SIGPRO_CM_CONFIG2_RFU_MANCHESTER_DEC_ENABLE_POS                                                  (7U)
#define SIGPRO_CM_CONFIG2_RFU_MANCHESTER_DEC_ENABLE_MASK                                                 (0x00000080U)  /**< rw-If set the Manchester decoder is activated for FeliCa PICC reception. Note that the Manchester decoder must be activated in general target mode to be able to detect FeliCa.*/
#define SIGPRO_CM_CONFIG2_RFU_MILLER_DEC_ENABLE_POS                                                      (6U)
#define SIGPRO_CM_CONFIG2_RFU_MILLER_DEC_ENABLE_MASK                                                     (0x00000040U)  /**< rw-If set the Miller decoder is activated for ISO14443 type A PICC reception. Note that the Miller decoder must be activated in general target mode to be able to detect ISO14443 type A.*/
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_CALIB_OFF_POS                                                   (5U)
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_CALIB_OFF_MASK                                                  (0x00000020U)  /**< rw-If set, the calibration of the advanced Miller decoder is deactivated and the nominal threshold values are used.*/
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_EDGE_SEL_POS                                                    (4U)
#define SIGPRO_CM_CONFIG2_RFU_ADV_MILLER_EDGE_SEL_MASK                                                   (0x00000010U)  /**< rw-Select the edge for decoding Note: This feature is not available in combination with ADV_MILLER_USE_RFCOUNTER. 0* decoder counts from falling to falling edge: 1 decoder counts from rising to rising edge. */
#define SIGPRO_CM_CONFIG2_RFU_CM_EGT_CHECK_POS                                                           (3U)
#define SIGPRO_CM_CONFIG2_RFU_CM_EGT_CHECK_MASK                                                          (0x00000008U)  /**< rw-If set, the EGT check for ISO14443 type B card-mode is activated. An invalid EGT length causes an protocol error.*/
#define SIGPRO_CM_CONFIG2_RFU_TAU_POS                                                                    (1U)
#define SIGPRO_CM_CONFIG2_RFU_TAU_MASK                                                                   (0x00000006U)  /**< rw-Defines the timing constant of the internal PLL as a negative power of two. */
#define SIGPRO_CM_CONFIG2_RFU_MODE_DETECTOR_OFF_POS                                                      (0U)
#define SIGPRO_CM_CONFIG2_RFU_MODE_DETECTOR_OFF_MASK                                                     (0x00000001U)  /**< rw-If set to 1; the mode detector is deactivated */

#define SIGPRO_RM_CONFIG_RFU                                                                              0x39U
#define SIGPRO_RM_CONFIG_RFU_SYNC_VAL_POS                                                                (16U)
#define SIGPRO_RM_CONFIG_RFU_SYNC_VAL_MASK                                                               (0xFFFF0000U)  /**< rw-Defines the Sync Pattern; which is expected to be sent as preamble before the actual data. */
#define SIGPRO_RM_CONFIG_RFU_SYNC_LEN_POS                                                                (12U)
#define SIGPRO_RM_CONFIG_RFU_SYNC_LEN_MASK                                                               (0x0000F000U)  /**< rw-Defines how many Bits of Sync_Val are valid. Example: 0 .. 1 Bit. */
#define SIGPRO_RM_CONFIG_RFU_SYNC_NEGEDGE_POS                                                            (11U)
#define SIGPRO_RM_CONFIG_RFU_SYNC_NEGEDGE_MASK                                                           (0x00000800U)  /**< rw-Defines a SOF with no min or max in correlation. The bitgrid will be defined by the neg edge (EPC; UID). */
#define SIGPRO_RM_CONFIG_RFU_LAST_SYNC_HALF_POS                                                          (10U)
#define SIGPRO_RM_CONFIG_RFU_LAST_SYNC_HALF_MASK                                                         (0x00000400U)  /**< rw-The last Bit of the Synccode has only half of the length compared to all other bits (EPC V2). */
#define SIGPRO_RM_CONFIG_RFU_SYNC_TYPE_POS                                                               (8U)
#define SIGPRO_RM_CONFIG_RFU_SYNC_TYPE_MASK                                                              (0x00000300U)  /**< rw-Set to 0 all 16 bits of SyncVal are interpreted as bits. Set to 1 a nipple of bits is interpreted as one bit in following way:{data; coll} data=zero or one; coll=1 means a collision on this bit. Note: if Coll=1 the vale of data is ignored.  Set to 2 the synchronisation is done at every startbit of each byte (TypeB)*/
#define SIGPRO_RM_CONFIG_RFU_RESERVED_POS                                                                (7U)
#define SIGPRO_RM_CONFIG_RFU_RESERVED_MASK                                                               (0x00000080U)  /**< r--Reserved */
#define SIGPRO_RM_CONFIG_RFU_EGT_CHECK_POS                                                               (6U)
#define SIGPRO_RM_CONFIG_RFU_EGT_CHECK_MASK                                                              (0x00000040U)  /**< rw-Set to 1; enables the EGT check functionality. An invalid EGT length causes an protocol error */
#define SIGPRO_RM_CONFIG_RFU_CORR_SPEED_POS                                                              (4U)
#define SIGPRO_RM_CONFIG_RFU_CORR_SPEED_MASK                                                             (0x00000030U)  /**< rw-Defines the number of clocks used for one correlation. 00* ISO14443 01 ICODE 53kBaud; FeliCa 424 kBaud 10 ICODE 26kBaud; FeliCa 212 kBaud 11 RFU*/
#define SIGPRO_RM_CONFIG_RFU_CORR_FREQ_POS                                                               (2U)
#define SIGPRO_RM_CONFIG_RFU_CORR_FREQ_MASK                                                              (0x0000000CU)  /**< rw-Sets the correlation frequency 00:212 kHz 01:424 kHz 10:848 kHz 11:848 kHz */
#define SIGPRO_RM_CONFIG_RFU_CORR_LENGTH_POS                                                             (1U)
#define SIGPRO_RM_CONFIG_RFU_CORR_LENGTH_MASK                                                            (0x00000002U)  /**< rw-Reserved */
#define SIGPRO_RM_CONFIG_RFU_CORR_INV_POS                                                                (0U)
#define SIGPRO_RM_CONFIG_RFU_CORR_INV_MASK                                                               (0x00000001U)  /**< rw-Defines a logical one: 0:subcarrier / no subcarrier 1:no subcarrier / subcarrier*/

